function testInit(testName)
{
	testOficialTitle=testName;
	/*обнуление всех текущих счетчиков*/
	answerCounter=0;
	correctAnswerCounter=0;
	passCounter =0;
	currentTaskCounter=0;
	timeCounter=0;
	testTime=0;
	testLength=0;
	/*Обнуление массива заданий*/
	taskArray=new Array();
	/*Массив правильных ответов*/
	var answerArray=new Array();
	/*Массив типов вопросов теста*/
	var taskTypeArray=new Array();
	/*Массив баллов за правильные ответы*/
	var taskMarkArray=new Array();
	
	/*Оценки за задания тестов*/
	/*Инициализация тестов в зависимости от названия теста*/

/*************************************************************/
//Тесты по украинскому языку	
/*************************************************************/
/*ЗНО-2009 Украинский язык и литература*/
	if(testName==znoUkr2009Main)
	{
		testLength=61;
		timeCounter=180*60;
		testTime=timeCounter;
		testDirectory='\/test\/ukr\/img\/test2009\/';
		testTitle = znoName+"2009"+znoUkrName;
		testDetails=mainName;
		answerLanguage="rus";
		var Kvitka='	Квітка на асфальті\n\n	(1-4) Далеко не всім у нас відома Квітка Цісик — американка українського походження, майже містична співачка. Ця аудіомісіонерка зробила для пропаганди української душі у світі, мабуть, більше, ніж президенти. Її неповторне виконання — просвітлена приреченість, а її доля — фатальний відхід майже на зльоті.\n	(5-9) Ті, хто чув її композиції (а це відомі пісні, у тому числі «Два кольори», «Я піду в далекі гори», «Чуєш, брате мій»), не можуть звільнитися від їхнього енергетичного впливу. Перший диск записаний 1980-го, другий — через дев’ять років. Кожен з «утаємничених» у її творчість може розповісти, як уперше почув і здивувався: «А звідки тут янголи?».\n	(10-13) Виявилося, янгол поселився у старій касеті. Хіба вгадаєш, у якій подобі Творець відправляє на землю своїх гінців, і хіба завбачиш, якої миті він покличе їх назад? От тільки ті 1990-ті були не янгольські. І ніщо не віщувало появи цього голосу «нізвідки» — на диво місцевій естраді.\n	(14-16) Зірок тоді наплодилося необлікована кількість. Більше, ніж на небі. Творець навіть розгубився... Але ж душа все одно лишалася байдужою до підступів. Тріскотіть, співайте, вийте! А ми, можливо, й дочекаємося свого — янгола?\n	(17-19) …І тут доведеться згадати добрим словом свідомих українських піратів. Спасибі, друзі, за те, що з далекого берега доставляли в тривожний час не тільки товари народного вжитку, а й перлини у вигляді касет — цю саму Квітку.\n	(20-28) Після того, як її записи стали проникати в місцеві програвачі й у деякі серця, з’явилися легенди. Адже багато хто чув, але ніхто не бачив, а голос хвилював. Казали, ніби її предки — із аристократичного музичного роду, наче в Америці вона вмирає від хвороби. І співає на паперті українських пісень, бо «не має на що жити!». І то правда: у деяких її піснях проривалося щось зрошене сльозою розлуки, благанням про милість. Ніби стоїть ця гарна дівчина посеред Брукліна, коханим покинута, долею скривджена, батьківщиною забута, і виводить пісню знетямлено, протяжно, жалібно. І я навіть уявляв собі її самозаглиблений погляд і відсторонену байдужість до світу. Оскільки і світ байдужий до неї, бо в ньому місце не квіткам, а будякам.\n	(29-33) Згодом усе виявилося не таким драматичним. У дівчини справді було романтичне минуле. Її родина ніколи не забувала про рідну землю, на якій тільки у мріях і ростуть виняткові квіти. І долю доньки, названої вигадливо, як для техногенної Америки, — Квіткою, її батьки бачили виключно в музичному орнаменті.\n	(34-38) Квітка вступила до нью-йоркської консерваторії. Та розчарую шанувальників американської мрії. Оперне майбутнє не склалося, а її американською «дійсністю» стає... рекламний конвеєр, і ось вона — цей янгол — співає дивним тембром сто мільйонів разів якісь «трелі»-заставки для коли.\n	(39-43) Було в її кар’єрі й залучення до «великого» кіно. Але це так – мимохідь – так і не розквітла для «Оскара». Але родичі чітко усвідомили: призначення цього херувима не кока-кола, а щось неземне. Те, що залишається тільки у творчості. Тому і сподобилися допомогти їй у «сімейній вигадці» — записі українських пісень, які вона ввібрала з материнським молоком.\n	(44-49) Свої кревні 200 тисяч доларів ця вродлива й розкута американка вкладає в «український проект». У сімейні альбоми. Ніби «не для продажу». Українська — не найдосконаліша в її розмовній мові (м’яко кажучи). Але вимову контролює мама. У результаті народжується щось ніким не очікуване... Наче «відкриваючи» для себе українську мову, Квітка «з чистого аркуша» розповідає відомі пісенні сюжети. А ми сприймаємо їх — «як уперше».\n	(50-54) Виконує хрестоматійні «Два кольори». Мільярд разів чуті. Але небесний тембр — мимохіть — ніби вириває зі строфи одне слово: «Червоне — то любов, а чорне — то-о-о-о… журба». І в «то-о-о» — горе знання і небажання зустріти «журбу». Вона немовби відтягує цю зустріч і хоче залишитися на іншому кінці «кольору» — тільки в любові.\n	(55-57) «Чуєш, брате мій...» — про смерть на чужині. Співає, як поминальну молитву. Голос злегка тремтить. У кожній інтонації — прощання. І це, скажете, не передчуття янгола, якому невдовзі доведеться... «повернутися»?\n	(58-59) 1998-го вона й розтанула свічкою на «рідній чужині» — від невиліковної хвороби.\n	(60-67) ...Ще вона фантастично записала за дев’ять років до смерті «Я піду в далекі гори». І саме в американської українки виявилося найбагатше змістове й емоційне аранжування. Так виходить... коли «як уперше». Магнетичний тембр летить над Карпатами, а там — загублений Іван із «Тіней забутих предків» усе шукає і шукає свою Марічку. Вслухайтеся — пригадаєте фільм... До речі, хто знав, що вже інший янгол зовсім в інший час пролетить над Карпатами і торкнеться крилом тоді ще ще маловідомого режисера, і в результаті народиться «кіномелодія» на всі часи. І ніхто ніколи переспівати її не зможе.\n	(68-71) Саму Квітку дехто намагався «переспівати». Тільки без усіляких реклам поціновувач якщо шукає, то знаходить не удаваних, а справжню. Ніякі продюсери не «прорахували» б подібну Квітку, яка співає. Співає за океаном, а українську душу відчуває глибше, ніж ті, що з нашого «асфальту».\n	(72-73) Як і раніше, вона існує не «всупереч», а просто окремо. Хто почує — той молодець. У її голосі — туга за надіями марними, гарними, такими — як у «раю».\n\n	За О. Вергелісом, газета «Дзеркало тижня»';
		gradeArray=new Array("100.0","100.5","100.5","100.5","100.5","100.5","100.5","100.5","100.5","101.0","101.5","102.0","103.0","104.0","105.0","106.5","108.0","109.5","111.5","113.0","115.0","116.5","118.5","120.0","121.5","123.5","125.0","126.5","128.0","129.5","130.5","132.0","133.5","134.5","136.0","137.0","138.5","139.5","141.0","142.0","143.0","144.5","145.5","146.5","147.5","148.5","150.0","151.0","152.0","153.0","154.0","155.0","156.0","157.0","158.0","159.0","156.5","161.0","162.0","162.5","163.5","164.5","165.5","166.5","167.5","168.0","169.0","170.0","171.0","172.0","173.0","173.5","174.5","175.5","176.5","177.5","178.0","179.0","180.0","181.0","182.0","183.0","184.0","185.0","186.0","187.0","188.0","189.0","190.0","191.0","192.0","193.0","194.0","194.5","195.5","196.5","197.0","197.5","198.0","198.5","199.0","199.5","199.5","200.0","200.0","200.0","200.0","200.0","200.0","200.0","200.0","200.0");
		answerArray=new Array("b","c","b","b","a","c","d","e","b","d","c","a","b","c","a","c","b","a","e","e","c","c","c","beda","dcba","ecda","cabd","cbde","a","a","c","c","d","d","a","b","b","b","e","c","e","b","d","d","e","b","c","c","b","b","e","b","b","a","c","d","deca","dabe","dcea","bade"," ");
		taskTypeArray=new Array("test","test","test","test","test","test","test","test","test","test","test","test","test","test","test","test","test","test","test","test","test","test","test","connect","connect","connect","connect","connect","textanalysis","textanalysis","textanalysis","textanalysis","textanalysis","textanalysis","textanalysis","textanalysis","test","test","test","test","test","test","test","test","test","test","test","test","test","test","test","test","test","test","test","test","connect","connect","connect","connect","tvir");
		textAnalysisArray=new Array("test","test","test","test","test","test","test","test","test","test","test","test","test","test","test","test","test","test","test","test","test","test","test","connect","connect","connect","connect","connect",Kvitka,Kvitka,Kvitka,Kvitka,Kvitka,Kvitka,Kvitka,Kvitka,"test","test","test","test","test","test","test","test","test","test","test","test","test","test","test","test","test","test","test","test","connect","connect","connect","connect","tvir");
		taskMarkArray=new Array(1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,4,4,4,4,4,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,4,4,4,4,24);
		variantNumberArray=new Array(4,4,4,4,4,4,4,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,0,0,0,0,0,4,4,4,4,4,4,4,4,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,0,0,0,0,0);
		for (var i=0; i<testLength; i++)
		{
			curView=new view(testName,i+1,testDirectory,"picture",variantNumberArray[i], "vertical", answerLanguage, "", "");
			taskArray[i]=new task(taskTypeArray[i],taskMarkArray[i],answerArray[i],curView);
		}	
	}

/*Завершение инициализации тестов*/
/*Заполнение поля дано ответов*/

		startInitialization();
	 			
}
